Revit 2027 API
ElementRecord.HasBoundingBox Method
 Determines whether this element record has a bounding box.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasBoundingBox()
Public Function HasBoundingBox As Boolean
public:
bool HasBoundingBox()
member HasBoundingBox : unit -> bool
Return Value
Boolean
 True if the element record has a bounding box or false otherwise.
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace